erp3l/src/Documents/ЗаявкаНаКорректировкуЛимитов/ЗаявкаНаКорректировкуЛимитов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаКорректировкуЛимитов</name>
  <basedOn>Document.ВерсияСоглашенияКоммерческийДоговор</basedOn>
  <basedOn>Document.ВерсияСоглашенияАккредитив</basedOn>
  <basedOn>Document.ВерсияСоглашенияБанковскаяГарантия</basedOn>
  <basedOn>Document.ВерсияСоглашенияВалютноПроцентныйСвоп</basedOn>
  <basedOn>Document.ВерсияСоглашенияВалютныйСвоп</basedOn>
  <basedOn>Document.ВерсияСоглашенияВалютныйФорвард</basedOn>
  <basedOn>Document.ВерсияСоглашенияДепозит</basedOn>
  <basedOn>Document.ВерсияСоглашенияКредит</basedOn>
  <basedOn>Document.УдалитьВерсияСоглашенияЛизинг</basedOn>
  <registerRecords>AccumulationRegister.ЛимитыПоБюджетам</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DefinedType.ОснованияДокументаЗаявкаНаКорректировкуЛимитов</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>DefinedType.Договоры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Планы</name>
    <attributes>
      <name>ВидБюджета</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодОтчета</name>
      <type>
        <types>CatalogRef.Периоды</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦФО</name>
      <type>
        <types>DefinedType.ЦФО</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>DefinedType.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяБюджета</name>
      <type>
        <types>Characteristic.ВидыБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика1</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика2</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика3</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика4</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика5</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика6</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>DefinedType.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриходРасход</name>
      <type>
        <types>EnumRef.ВидыДвиженийПриходРасход</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументПланирования</name>
      <type>
        <types>DocumentRef.ОперативныйПлан</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЛимитыПоБюджетам</name>
    <attributes>
      <name>ВидБюджета</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодЛимитирования</name>
      <type>
        <types>CatalogRef.Периоды</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦФО</name>
      <type>
        <types>DefinedType.ЦФО</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>DefinedType.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяБюджета</name>
      <type>
        <types>Characteristic.ВидыБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика1</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика2</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика3</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика4</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика5</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика6</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>DefinedType.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРезервирования</name>
      <type>
        <types>DocumentRef.ОперативныйПлан</types>
      </type>
    </attributes>
    <attributes>
      <name>Свободно</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>КОбеспечению</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособОпределенияВалютыЛимитирования</name>
      <type>
        <types>EnumRef.СпособыОпределенияВалютыЛимитирования</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользоватьЛимитирование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

erp3l/src/Documents/ЗаявкаНаКорректировкуЛимитов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = Пользователи.ТекущийПользователь();
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Источник = ДанныеЗаполнения;
	ТипИсточника = ТипЗнч(Источник);
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Ответственный", Пользователи.ТекущийПользователь());
	
	Если ТипИсточника = Тип("Структура") Тогда
		Если Источник.Свойство("ЛимитыПоБюджетам") Тогда
			Для Каждого Строка Из Источник.ЛимитыПоБюджетам Цикл
				ЗаполнитьЗначенияСвойств(ЛимитыПоБюджетам.Добавить(), Строка);
			КонецЦикла;
			
			ЗаполнитьПараметрыЛимитирования();
			
		КонецЕсли;
		
	ИначеЕсли ЭтотОбъект.Метаданные().Реквизиты.Основание.Тип.СодержитТип(ТипИсточника) Тогда
		//
		ЗаполнитьПоЗаявке(Источник, ТипИсточника, ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//
	ПроведениеСерверОПК.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	Документы.ЗаявкаНаКорректировкуЛимитов.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	ПроведениеСерверОПК.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);	
	
	//
	КонтрольЛимитовУХ.ОтразитьЛимитыПоБюджетам(ДополнительныеСвойства, Движения, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПараметрыЛимитирования()
	
	ВидБюджетаПериодЛимитирования = ЛимитыПоБюджетам.Выгрузить(, "ВидБюджета, ПериодЛимитирования");
	ВидБюджетаПериодЛимитирования.Свернуть("ВидБюджета, ПериодЛимитирования", "");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ОбщегоНазначенияОПК.ЗагрузитьТаблицуВоВременнуюТаблицуЗапроса(Запрос, "ВТ_ВидБюджетаПериод", ВидБюджетаПериодЛимитирования);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВТ_ВидБюджетаПериод.ВидБюджета КАК ВидБюджета,
	|	ВТ_ВидБюджетаПериод.ПериодЛимитирования КАК ПериодЛимитирования,
	|	ПараметрыЛимитирования.Период КАК Период,
	|	ПараметрыЛимитирования.ПериодичностьЛимитирования КАК ПериодичностьЛимитирования,
	|	ПараметрыЛимитирования.СпособОпределенияВалютыЛимитирования КАК СпособОпределенияВалютыЛимитирования,
	|	ПараметрыЛимитирования.ИспользоватьЛимитирование КАК ИспользоватьЛимитирование
	|ИЗ
	|	ВТ_ВидБюджетаПериод КАК ВТ_ВидБюджетаПериод
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыЛимитирования КАК ПараметрыЛимитирования
	|		ПО ВТ_ВидБюджетаПериод.ВидБюджета = ПараметрыЛимитирования.ВидБюджета
	|			И (НАЧАЛОПЕРИОДА(ВТ_ВидБюджетаПериод.ПериодЛимитирования.ДатаНачала, ГОД) = ПараметрыЛимитирования.Период)";
	
	ПараметрыЛимитирования = Запрос.Выполнить().Выгрузить();
	
	СтруктураПоиска = Новый Структура("ВидБюджета, ПериодЛимитирования");
	ЗаполняемыеРеквизиты = "СпособОпределенияВалютыЛимитирования, ИспользоватьЛимитирование";
	
	Для Каждого СтрокаПараметров Из ПараметрыЛимитирования Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаПараметров);
		Строки = ЛимитыПоБюджетам.НайтиСтроки(СтруктураПоиска);
		Для Каждого Строка Из Строки Цикл
			ЗаполнитьЗначенияСвойств(Строка, СтрокаПараметров, ЗаполняемыеРеквизиты);
		КонецЦикла;
		
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ЗаполнитьПоЗаявке(Источник, ТипИсточника, ДанныеЗаполнения)
	
	ДанныеЗаполнения.Вставить("Основание", Источник);
	Документы.ЗаявкаНаКорректировкуЛимитов.ЗаполнитьТаблицыПоДокументуОснованию(ЭтотОбъект, Источник)
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
